Beattraceur/esp8266-react/src/main.cpp
#include <ESP8266React.h>
#include <LightMqttSettingsService.h>
#include <RelayMqttSettingsService.h>
#include <LightStateService.h>
#include <RelayStateService.h>

#define SERIAL_BAUD_RATE 115200

AsyncWebServer server(80);
ESP8266React esp8266React(&server);
LightMqttSettingsService lightMqttSettingsService =
    LightMqttSettingsService(&server, esp8266React.getFS(), esp8266React.getSecurityManager());

RelayMqttSettingsService relayMqttSettingsService =
    RelayMqttSettingsService(&server, esp8266React.getFS(), esp8266React.getSecurityManager());

LightStateService lightStateService = LightStateService(&server,
                                                        esp8266React.getSecurityManager(),
                                                        esp8266React.getMqttClient(),
                                                        &lightMqttSettingsService);
RelayStateService relayStateService = RelayStateService(&server,
                                                        esp8266React.getSecurityManager(),
                                                        esp8266React.getMqttClient(),
                                                        &relayMqttSettingsService);

void setup() {
  // start serial and filesystem
  Serial.begin(SERIAL_BAUD_RATE);

  // start the framework and demo project
  esp8266React.begin();

  // load the initial light settings
  lightStateService.begin();
  relayStateService.begin();

  // start the light service
  lightMqttSettingsService.begin();
  relayMqttSettingsService.begin();

  // start the server
  server.begin();
}

void loop() {
  // run the framework's loop function
  esp8266React.loop();
}
